#+TITLE:     Notes on Chapter 32: The Fast Fourier Transform
#+AUTHOR:    Chris Lowis
#+EMAIL:     chris.lowis@gmail.com
#+OPTIONS:   H:2 num:nil toc:nil \n:nil @:t ::t |:t ^:{} _:{} *:t TeX:t LaTeX:t

** The DFT

The discrete version of the fourier transform is

\[
F_k = \sum\limits_{n=0}^{N-1} f_n e^{-2\pi i k n / N}
\]

I've used a slightly different notation here than in the chapter,
because I found it easier to read when it was all written on a single
line.

The large \( \sum \) is notation for summation, and the \( i \) is
the complex number \( \sqrt -1 \). We can translate this equation
into the equivalent ruby code

#+BEGIN_SRC ruby :session
  require 'complex'

  def dft(f)
    bigN = f.length
    bigF = Array.new(bigN)

    bigF.each_with_index do |_, k|
      bigF[k] = 0

      0.upto(bigN-1).each do |n|
        bigF[k] = bigF[k] +
          ( f[n] * Math::E ** (-2.0 * Math::PI * Complex(0, 1) * k * n / bigN) )
      end
    end

    bigF
  end
#+END_SRC

#+RESULTS:
: :dft

I've not tried to be idiomatic here, rather to mirror the equation as
closely as possible in ruby.

Let's use the code above to calculate the DFT of the input "image" \(
[0, 1, 0, 1, 0, 1] \) (this is exercise 1 in the problems at the end
of the chapter).

#+BEGIN_SRC ruby :exports both :session
  f = [0, 1, 0, 1, 0, 1]
  dft(f)
#+END_SRC

#+RESULTS:
| 3+0i                                           |
| 1.1102230246251565e-16-1.1102230246251565e-16i |
| 3.885780586188048e-16+1.1102230246251565e-16i  |
| -3.0-2.8785389586328684e-15i                   |
| -7.771561172376096e-16+3.3306690738754696e-16i |
| -1.2212453270876722e-15-3.219646771412954e-15i |

There's a lot of numerical noise here, but the output is \( [3, 0, 0,
-3, 0, 0] \).

One thing that wasn't very clear in the chapter is that \( k \) takes
integer values, and by convention these are normally chosen to be \(
[0 \dots N-1] \). Note that this also means that \( F_k \) is the same
length as \( f \), the input to the DFT.

** The DFT in Matrix Form in Ruby

We can implement that equation in ruby too. Doing matrix operations in
ruby using the standard library is a bit clunky, as accessing
individual elements of a matrix by their row and column numbers is not
supported. We can get around that by monkey patching the ~Matrix~ class

#+BEGIN_SRC ruby :session
require 'matrix'

class Matrix
  def []=(row, column, value)
    @rows[row][column] = value
  end
end
#+END_SRC

#+RESULTS:
: :[]=

We then define a matrix version of the DFT as follows

#+BEGIN_SRC ruby :session
def matrix_dft(f)
  bigN = f.size
  bigA = Matrix.identity(bigN)

  omega = Math::E ** (-2.0 * Math::PI * Complex(0, 1) / bigN)

  bigA.each_with_index do |_, row, col|
    bigA[row, col] = omega ** (row * col)
  end

  bigA * Vector.elements(f)
end
#+END_SRC

#+RESULTS:
: :matrix_dft

Evaluating that on the same input as earlier we get (roughly) the same result as before.

#+BEGIN_SRC ruby :session :exports both
matrix_dft(f).to_a
#+END_SRC

#+RESULTS:
| 3+0i                                           |
| -4.440892098500626e-16+1.1102230246251565e-16i |
| -9.992007221626409e-16+2.220446049250313e-16i  |
| -3.0000000000000004-3.885780586188048e-15i     |
| 2.1094237467877974e-15-4.440892098500626e-16i  |
| 2.55351295663786e-15-4.440892098500626e-16i    |

** The Inverse DFT in Matrix Form in Ruby

Converting back from a fourier transformed image to the original image
can be achieved by multiplying by the inverse of \( \mathbf{A} \)

\[
\mathbf{f} = \mathbf{A}^{-1}\mathbf{g}^T
\]

Which we can write in ruby as

#+BEGIN_SRC ruby :session
def matrix_idft(g)
  bigN = g.size
  bigA = Matrix.identity(bigN)

  omega = Math::E ** (-2.0 * Math::PI * Complex(0, 1) / bigN)

  bigA.each_with_index do |_, row, col|
    bigA[row, col] = omega ** (row * col)
  end

  bigA.inverse * Vector.elements(g)
end
#+END_SRC

#+RESULTS:
: :matrix_idft

We can check that our implementation works by taking the DFT and then
the inverse DFT of an input

#+BEGIN_SRC ruby :session :exports both
g = matrix_dft(f)
matrix_idft(g).to_a
#+END_SRC

#+RESULTS:
| -1.9721522630525295e-31-1.5728159515523116e-16i |
| 0.9999999999999999+9.00872486212117e-17i        |
| 1.6653345369377323e-16-2.4790280238887596e-18i  |
| 1.0+0.0i                                        |
| -2.775557561562888e-16+4.873832071660557e-17i   |
| 1.0000000000000002-1.4559839985247062e-16i      |
